Tekla Open API Reference for Tekla Structures 2025
Prefix Methods
The PartFilterExpressions.Prefix type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
PartFilterExpressions.Prefix Class
Tekla.Structures.Filtering.Categories Namespace